truck_fleet = [
    {"driver": "Иванов", "truck": "КАМАЗ", "status": "В рейсе"},
    {"driver": "Матвеев", "truck": "МАЗ", "status": "Ремонт двигателя"},
    {"driver": "Петров", "truck": "ГАЗзель", "status": "Ремонт подвески"}
]
# Входной список словарей
# Создаем фукцию проверки статуса в "Ремонте"
def stat(fleet_list):
    # Создаем пустой список для сбора результата
    box = []
    # Перебираем любой входящий список список
    for item in fleet_list:
        # Отбираем значение "Ремонт" в ключе "статус"
        if "Ремонт" in item["status"]:
            # Если нашли нужное значеие, добавляем значение ключа "driver" в список "box"
            box.append(item["driver"])
    # Возвращаем полученный список для дальнейше работы с ним
    return box
# Проверяем через функцию наш список словарй и выводим на экран результат
print(stat(truck_fleet))